In [3]:
import pandas as pd
import numpy as np
import seaborn as sns

구구단 9단을 짝수번째만 출력하시오.

<답안 예시>

9x2=18 9x4=36 9x6=54 9x8=72

In [4]:
n =9
for i in range (1,n+1):
    if i %2 ==0 :
        print(n,end="")
        print("x",end="")
        print(i, end="")
        print("=", end="")
        print(i*n,end=" ")


    #9x2=18

9x2=18 9x4=36 9x6=54 9x8=72

문제 2
다음 데이터를 사용하여 각 문항에 답하시오.

In [5]:
iris=sns.load_dataset('iris')
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

문제 [2-1] (10점)
iris의 species 열 값 분포를 확인하시오.

In [6]:
# 분포파악
iris["species"].value_counts()

# 추가확인
iris["species"].describe()

count           150
unique            3
top       virginica
freq             50
Name: species, dtype: object

문제 [2-2] (10점)
species 별로 각 변수의 최댓값을 구하시오.

In [9]:
#species 별로 각 변수의 최댓값을 구하시오.

iris_s=iris[iris["species"] == 'setosa']
iris_va=iris[iris["species"] == 'virginica']
iris_vr=iris[iris["species"] == 'versicolor']

print(iris_s.max(),iris_vr.max(),iris_va.max())

sepal_length       5.8
sepal_width        4.4
petal_length       1.9
petal_width        0.6
species         setosa
dtype: object sepal_length           7.0
sepal_width            3.4
petal_length           5.1
petal_width            1.8
species         versicolor
dtype: object sepal_length          7.9
sepal_width           3.8
petal_length          6.9
petal_width           2.5
species         virginica
dtype: object

문제 [2-3] (10점)
iris의 species 열 값을 setosa는 1, 그 외의 값들은 0으로 변환하시오. (apply, lambda 사용)

In [10]:
iris["species"] = iris["species"].apply(lambda x : 1 if x =='setosa' else 0)
#확인
iris["species"].value_counts()

0    100
1     50
Name: species, dtype: int64

문제 3
다음 데이터에 사용하여 각 문항에 따라 답하시오.

In [11]:
titanic=sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

문제 [3-1] (10점)
titanic에서 pclass, age, sibsp, fare, class 열만 뽑아 df에 저장하시오.

In [12]:
df =titanic[   ['pclass', 'age', 'sibsp', 'fare','class']]

문제 [3-2] (5점)
df의 열 별 결측치 개수를 구하시오.

In [13]:
df.isnull().sum()

pclass      0
age       177
sibsp       0
fare        0
class       0
dtype: int64

문제 [3-3] (10점)
df에 결측치가 있다면, 해당 열의 평균값으로 채우시오.

In [15]:
mean=df.age.mean()
df.age.fillna(mean)

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...
886    27.000000
887    19.000000
888    29.699118
889    26.000000
890    32.000000
Name: age, Length: 891, dtype: float64

문제 [3-4] (5점)
survived.csv를 불러와 survived에 저장하시오.

In [16]:
survived = pd.read_csv('survived.csv')

문제 [3-5] (10점)
기존에 생성한 df와 survived 데이터프레임을 병합해 df2에 저장하시오

In [17]:
df2 = pd.concat([df,survived],axis=1)

문제 [3-6] (20점)
df2 데이터에서 각 class 별 생존율을 구하시오

In [19]:
t = df2.loc[(df2['class'] == "Third")]
f = df2.loc[(df2['class'] == "Second")]
s = df2.loc[(df2['class'] == "First")]
def survived(seriess):
    s =0
    d =0
    for x in seriess :
        if x == 1:
            s+=1
        else: d+=1

    result= s/(s+d)
    return result
print(survived(f.survived),survived(s.survived),survived(t.survived))

0.47282608695652173 0.6296296296296297 0.24236252545824846